
public class Zad04 {

	public static void main(String[] args) {

		// Задача 4: Да се изведат на екрана числата от 10 до 1 в обратен ред.

		for (int i = 10; i >= 1; i--) {
			System.out.print(i + " ");

		}

	}

}
