
public class Zad03 {

	public static void main(String[] args) {

		// Задача 3: Да се изведат на екрана всички нечетни числа от -10 до 10

		for (int i = -9; i <= 10; i += 2) {
			System.out.println(i);

		}

	}

}
