import java.util.Scanner;

public class Zad13 {

	public static void main(String[] args) {

		// Задача 13:
		// Да се състави програма, която да отгатне колко е студено/топло по
		// въведената температура t в градус Целзий.
		// Температурните интервали са:
		// под -20 ледено студено;
		// между 0 и -20 - студено;
		// между 15 и 0 - хладно;
		// между 25 и 15 - топло;
		// над 25 – горещо.
		// Входни данни: цяло число от интервала [-100..100].
		// Пример: 12
		// Изход: хладно

		Scanner sc = new Scanner(System.in);
		System.out.println("Това е програма, която проверява дали колко е студено/топло по въведената температура.");
		System.out.println("Моля, въведете температурата t в градус Целзий [-100; 100]");
		System.out.print("t = ");
		byte t = sc.nextByte();
		sc.close();
		if (t < -100 || t > 100) {
			System.out.println("Въведената температура е твърде критична!");
		} else {
			if (t < -20) {
				System.out.println("Ледено студено е!");
			}
			if (t >= -20 && t <= 0) {
				System.out.println("Студено е!");
			}
			if (t > 0 && t < 15) {
				System.out.println("Хладно е!");
			}
			if (t >= 15 && t <= 25) {
				System.out.println("Топло е!");
			}
			if (t > 25) {
				System.out.println("Горещо е!");
			}

		}

	}

}
