import java.util.Scanner;

public class Zad10 {

	public static void main(String[] args) {
		// Задача 10:
		// Трябва да се напълни цистерна с вода. Имате 2 кофи с вместимост 2 и
		// 3 литра и ги ползвате едновременно.
		// Да се състави програма, която по даден обем извежда как ще прелеете
		// течността с тези кофи, т.е. по-колко пъти ще се пълни всяка от
		// кофите. Кофите не могат да се ползват с частично количество вода.
		// Входни данни: естествено число от интервала [10..9999].
		// Пример: 107
		// Изход: 21 пъти по 2 литра,
		// 21 пъти по 3 литра
		// допълнително кофа от 2 литра

		Scanner sc = new Scanner(System.in);
		System.out.println("Моля, въведете обема на цистерна с вода V [от 10 до 9999л.]:");
		System.out.print("V = ");
		int v = sc.nextInt();
		sc.close();
		if ((v < 10) || (v > 9999)) {
			System.out.println("Въведеният обем е извън допустимите граници!");
		} else {
			System.out.println("С помощта на 2 кофи от по 2л. и 3л. течността ще се прелее, използвайки");

			int bucket2 = v / 5;
			int bucket3 = v / 5;
			int last = v % 5;

			if (last == 1) {
				bucket2++;
				bucket3--;
			}
			if (last == 2) {
				bucket2++;
			}
			if (last == 3) {
				bucket3++;
			}
			if (last == 4) {
				bucket2 += 2;
			}
			System.out.println(bucket2 + " пъти 2-литровата и " + bucket3 + " пъти 3-литровата кофа.");

		}
	}

}
