import java.util.Scanner;

public class Zad16 {

	public static void main(String[] args) {
		// Задача 16:
		// Въведено е трицифрено естествено число от вида abc.
		// Трябва да се провери дали:
		// ако a = b = c - Изход: цифрите са равни;
		// ако a>b>c - Изход: цифрите са във възходящ ред;
		// ако a<b<c цифрите са в низходящ ред;
		// и изход: цифрите са ненаредени, за неописаните случаи.
		// Да се състави програма, която извежда резултата от проверката за
		// наредба на цифрите в числото.
		// Пример: 345
		// Изход: възходящ ред.

		Scanner sc = new Scanner(System.in);
		System.out.println("Това е програма, която проверява подредбата на цифрите на дадено трицифрено число.");
		System.out.println("Моля, въведете цяло трицифрено число x:");
		System.out.print("x = ");
		int x = sc.nextInt();
		sc.close();

		if (x <= 99 || x >= 1000) {
			System.out.println("Въведеното число не е трицифрено.");
		} else {

			int a = x / 100;
			int b = x % 100 / 10;
			int c = x % 10;

			if ((a == b) && (b == c)) {
				System.out.println("Цифрите на числото са равни.");

			} else if ((a < b) && (b < c)) {
				System.out.println("Цифрите на числото са във възходящ ред.");

			} else if ((a > b) && (b > c)) {
				System.out.println("Цифрите на числото са в низходящ ред.");

			} else {
				System.out.println("Цифрите на числото са ненаредени.");
			}

		}
	}

}
