import java.util.Scanner;

public class Zad7 {

	public static void main(String[] args) {
		// Задача 7:
		// Въведете 3 променливи от клавиатурата – час (целочислен тип), сума
		// пари (число с плаваща запетая), дали съм здрав – булев тип.
		// Съставете програма, която взема решения на базата на тези данни по
		// следния начин:
		// - ако съм болен, няма да излизам
		// - ако имам пари, ще си купя лекарства
		// - ако нямам – ще стоя вкъщи и ще пия чай
		// - ако съм здрав, ще отида на кино с приятели
		// - ако имам по-малко от 10 лв, ще отида на кафе.
		// Полученото решение покажете като съобщение в конзолата.

		Scanner sc = new Scanner(System.in);
		System.out.println("Това е програма, която ви съветва как да прекарате вечерта.");
		System.out.println("Моля, въведете час."); // Просто си питам, не че има
													// значение :D
		System.out.print("Часът е около ");
		int time = sc.nextInt();
		if (time < 0 || time > 24) {
			System.out.println("Въведеният час е невалиден, но все пак...");
		}
		
		System.out.println("Моля, въведете сумата, с която разполагате в момента.");
		System.out.print("Сумата в лева е ");
		double money = sc.nextDouble();

		System.out.println("Болен ли сте в момента?");
		System.out.println("true = Да, болен съм; false = Не, здрав съм");
		boolean sick = sc.nextBoolean();
		sc.close();

		if (sick) {
			if (money < 10) {
				System.out.println("Не излизайте днес, а пийте чай вкъщи!");
			} else {
				System.out.println("Не излизайте днес, освен за да си купите лекарства!");
			}
		} else {
			if (money >= 10) {
				System.out.println("Може да отидете на кино с приятели!");
			} else {
				System.out.println("Може да отидете на кафе с приятели!");
			}
		}
	}
}
